OpenNuvoton/M55M1BSP/SampleCode/MachineLearning/VisualWakeWords/Device/UVC/UVC.c
    /* Initialize Video Probe and Commit Control data */
    memset((uint8_t *)&uvcInfo.VSCmdCtlData, 0x0, sizeof(VIDEOSTREAMCMDDATA));
    uvcInfo.VSCmdCtlData.bmHint = 0x0100;
    uvcInfo.VSCmdCtlData.bFormatIndex = 1;
    uvcInfo.VSCmdCtlData.bFrameIndex = 2;
    uvcStatus.FormatIndex = 1;
    uvcStatus.FrameIndex = 2;
    uvcInfo.VSCmdCtlData.dwFrameInterval = 0x051615;

    /* Initialize Still Image Command data */
    memset((uint8_t *)&uvcInfo.VSStillCmdCtlData, 0x0, sizeof(VIDEOSTREAMSTILLCMDDATA));

    uvcInfo.VSStillCmdCtlData.bFormatIndex = 1;
    uvcInfo.VSStillCmdCtlData.bFrameIndex = 1;
    uvcStatus.snapshotFormatIndex = 1;
    uvcStatus.snapshotFrameIndex = 1;

    /* Enable HSUSBD interrupt */
    NVIC_EnableIRQ(HSUSBD_IRQn);
}

void UVC_ClassRequest(void)
{
    uint32_t volatile Data;

    if (gUsbCmd.bmRequestType & 0x80)
    {
        /* Device to host */
        /* Video Control Requests */
        /* Unit and Terminal Control Requests */
        /* Interface Control Requests */
        if (gUsbCmd.wIndex == 0x0000 && (gUsbCmd.wValue == VC_REQUEST_ERROR_CODE_CONTROL))  //Only send to Video Control interface ID(00)
        {
            HSUSBD_PrepareCtrlIn((uint8_t *)&uvcInfo.u8ErrCode, gUsbCmd.wLength);
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
            HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_INTKIEN_Msk);
        }
        //Processing Unit Control Requests
        else if (gUsbCmd.wIndex == 0x0500)  //Processing Unit ID(05) and Video Control interface ID(00)
        {
            Data = UVC_PU_Info(gUsbCmd.bRequest, gUsbCmd.wValue);
            HSUSBD_PrepareCtrlIn((uint8_t *)&uvcInfo.u8ErrCode, gUsbCmd.wLength);
            HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
            HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_INTKIEN_Msk);
        }
        //Camera Terminal Control Requests
        else if (gUsbCmd.wIndex == 0x0100)  //Camera Terminal ID(01) and Video Control interface ID(00)
        {
            uvcInfo.u8ErrCode = EC_Invalid_Control;
            /* STALL control pipe */
            HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_STALLEN_Msk);
        }
        ///Videostreaming Requests
        else if (gUsbCmd.wIndex == 0x0001)  //VideoStreaming interface(0x01)
        {
            if ((gUsbCmd.wValue == VS_PROBE_CONTROL) || (gUsbCmd.wValue == VS_COMMIT_CONTROL))
            {
                if ((gUsbCmd.bRequest == UVC_GET_INFO) || (gUsbCmd.bRequest == UVC_GET_LEN))
                {
                    if (gUsbCmd.bRequest == UVC_GET_INFO)
                        Data = 3;//Info
                    else
                        Data = 26;//Length

                    HSUSBD_PrepareCtrlIn((uint8_t *)&Data, gUsbCmd.wLength);
                    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
                    HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_INTKIEN_Msk);
                }
                else
                {
                    if ((uvcInfo.VSCmdCtlData.bFormatIndex != uvcInfo.u32FormatIndx) || (uvcInfo.VSCmdCtlData.bFrameIndex != uvcInfo.u32FrameIndx))
                    {
                        uvcStatus.FormatIndex = uvcInfo.u32FormatIndx = uvcInfo.VSCmdCtlData.bFormatIndex;
                        uvcStatus.FrameIndex = uvcInfo.u32FrameIndx = uvcInfo.VSCmdCtlData.bFrameIndex;

                        uvcInfo.bChangeData = 1;
                    }

                    switch (uvcInfo.VSCmdCtlData.bFrameIndex)
                    {
                        case UVC_QQVGA://160*120(5)
                            uvcInfo.VSCmdCtlData.dwMaxVideoFrameSize = UVC_SIZE_QQVGA;
                            break;

                        case UVC_QVGA://320*240(3)
                            uvcInfo.VSCmdCtlData.dwMaxVideoFrameSize = UVC_SIZE_QVGA;
                            break;

                        case UVC_VGA://640*480(1)
                            uvcInfo.VSCmdCtlData.dwMaxVideoFrameSize = UVC_SIZE_VGA;
                            break;
                    }

                    //************Depend on the specificed frame*****************//

                    uvcInfo.VSCmdCtlData.dwMaxPayloadTransferSize = uvcInfo.IsoMaxPacketSize[gAltInterface];

                    uvcStatus.MaxVideoFrameSize = uvcInfo.VSCmdCtlData.dwMaxVideoFrameSize;
                    uvcInfo.VSCmdCtlData.dwMaxPayloadTransferSize = gMaxPacketSize;
                    uvcInfo.VSCmdCtlData.wCompQuality = 0x3D;
                    HSUSBD_PrepareCtrlIn((uint8_t *)&uvcInfo.VSCmdCtlData, gUsbCmd.wLength);
                    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
                    HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_INTKIEN_Msk);
                }
            }
            else if ((gUsbCmd.wValue == VS_STILL_PROBE_CONTROL) || (gUsbCmd.wValue == VS_STILL_COMMIT_CONTROL))
            {
                if ((gUsbCmd.bRequest == UVC_GET_INFO) || (gUsbCmd.bRequest == UVC_GET_LEN))
                {
                    if (gUsbCmd.bRequest == UVC_GET_INFO)
                        Data = 3;//Info
                    else
                        Data = 11;//Length

                    HSUSBD_PrepareCtrlIn((uint8_t *)&Data, gUsbCmd.wLength);
                    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
                    HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_SETUPPKIEN_Msk | HSUSBD_CEPINTEN_INTKIEN_Msk);
                }
                else
                {
                    switch (uvcInfo.VSStillCmdCtlData.bFrameIndex)
                    {
                        case UVC_STILL_QQVGA://160*120(7)
                            uvcInfo.VSStillCmdCtlData.dwMaxVideoFrameSize = UVC_SIZE_QQVGA;
                            break;

                        case UVC_STILL_QVGA://320*240(5)
                            uvcInfo.VSStillCmdCtlData.dwMaxVideoFrameSize = UVC_SIZE_QVGA;
                            break;

