OpenNuvoton/M55M1BSP/SampleCode/MachineLearning/VisualWakeWords/Device/UVC/UVC.c
                case PU_HUE_CONTROL:
                    return uvcPuInfo.PU_HUE_MAX;

                case PU_SATURATION_CONTROL:
                    return uvcPuInfo.PU_SATURATION_MAX;

                case PU_SHARPNESS_CONTROL:
                    return uvcPuInfo.PU_SHARPNESS_MAX;

                case PU_GAMMA_CONTROL:
                    return uvcPuInfo.PU_GAMMA_MAX;

                case PU_POWER_LINE_FREQUENCY_CONTROL:
                    return uvcPuInfo.PU_POWER_LINE_FREQUENCY_MAX;

                default:
                    uvcInfo.u8ErrCode = EC_Invalid_Control;
                    return 6;
            }

        case UVC_GET_RES:
            return 1;

        case UVC_GET_INFO:
            switch (Unit)
            {
                case PU_BACKLIGHT_COMPENSATION_CONTROL:
                case PU_BRIGHTNESS_CONTROL:
                case PU_CONTRAST_CONTROL:
                case PU_HUE_CONTROL:
                case PU_SATURATION_CONTROL:
                case PU_SHARPNESS_CONTROL:
                case PU_GAMMA_CONTROL:
                case PU_POWER_LINE_FREQUENCY_CONTROL:
                    return 3;

                default:
                    uvcInfo.u8ErrCode = EC_Invalid_Control;
                    return 0;
            }

        case UVC_GET_DEF:
            switch (Unit)
            {
                case PU_BACKLIGHT_COMPENSATION_CONTROL:
                    return uvcPuInfo.PU_BACKLIGHT_COMPENSATION_DEF;

                case PU_BRIGHTNESS_CONTROL:
                    return uvcPuInfo.PU_BRIGHTNESS_DEF;

                case PU_CONTRAST_CONTROL:
                    return uvcPuInfo.PU_CONTRAST_DEF;

                case PU_HUE_CONTROL:
                    return uvcPuInfo.PU_HUE_DEF;

                case PU_SATURATION_CONTROL:
                    return uvcPuInfo.PU_SATURATION_DEF;

                case PU_SHARPNESS_CONTROL:
                    return uvcPuInfo.PU_SHARPNESS_DEF;

                case PU_GAMMA_CONTROL:
                    return uvcPuInfo.PU_GAMMA_DEF;

                case PU_POWER_LINE_FREQUENCY_CONTROL:
                    return uvcPuInfo.PU_POWER_LINE_FREQUENCY_DEF;

                default:
                    uvcInfo.u8ErrCode = EC_Invalid_Control;
                    return 6;
            }

        case UVC_GET_LEN:
            uvcInfo.u8ErrCode = EC_Invalid_Request;
            return 6;
    }

    return 6;
}

/* Process Unit Control */
uint32_t UVC_ProcessUnitControl(uint32_t u32ItemSelect, uint32_t u32Value)
{
    switch (u32ItemSelect)
    {
        case PU_BACKLIGHT_COMPENSATION_CONTROL:
            //printf("Set Backlight -> %d\n",u32Value);
            break;

        case PU_BRIGHTNESS_CONTROL:
            //printf("Set Brightness -> %d\n",u32Value);
            break;

        case PU_CONTRAST_CONTROL:
            //printf("Set Contrast -> %d\n",u32Value);
            break;

        case PU_HUE_CONTROL:
            //printf("Set Hue -> %d\n",u32Value);
            break;

        case PU_SATURATION_CONTROL:
            //printf("Set Saturation -> %d\n",u32Value);
            break;

        case PU_SHARPNESS_CONTROL:
            //printf("Set Sharpness -> %d\n",u32Value);
            break;

        case PU_GAMMA_CONTROL:
            //printf("Set Gamma -> %d\n",u32Value);
            break;

        case PU_POWER_LINE_FREQUENCY_CONTROL:
            //printf("Set Power Line Frequency -> %d\n",u32Value);
            break;

        default:
            ;
    }

    return 0;
}

void UVC_PU_Control(int16_t Value)
{
    uvcInfo.u8ErrCode = 0;

    switch (gUsbCmd.wValue)
    {
        case PU_BACKLIGHT_COMPENSATION_CONTROL:
            if (Value >= uvcPuInfo.PU_BACKLIGHT_COMPENSATION_MIN && Value <= uvcPuInfo.PU_BACKLIGHT_COMPENSATION_MAX)
            {
                uvcInfo.CapFilter.Backlight = Value;
                UVC_ProcessUnitControl(PU_BACKLIGHT_COMPENSATION_CONTROL, Value);
                return;
            }

            break;

        case PU_BRIGHTNESS_CONTROL:
            if (Value >= uvcPuInfo.PU_BRIGHTNESS_MIN && Value <= uvcPuInfo.PU_BRIGHTNESS_MAX)
            {
                uvcInfo.CapFilter.Brightness = Value;
                UVC_ProcessUnitControl(PU_BRIGHTNESS_CONTROL, Value);
                return;
            }

            break;

        case PU_CONTRAST_CONTROL:
            if (Value >= uvcPuInfo.PU_CONTRAST_MIN && Value <= uvcPuInfo.PU_CONTRAST_MAX)
            {
                uvcInfo.CapFilter.Contrast = Value;
                UVC_ProcessUnitControl(PU_CONTRAST_CONTROL, Value);
                return;
            }

            break;

        case PU_HUE_CONTROL:
            if (Value >= uvcPuInfo.PU_HUE_MIN && Value <= uvcPuInfo.PU_HUE_MAX)
            {
                uvcInfo.CapFilter.Hue = Value;
                UVC_ProcessUnitControl(PU_HUE_CONTROL, Value);
                return;
            }

            break;

        case PU_SATURATION_CONTROL:
            if (Value >= uvcPuInfo.PU_SATURATION_MIN && Value <= uvcPuInfo.PU_SATURATION_MAX)
            {
                uvcInfo.CapFilter.Saturation = Value;
                UVC_ProcessUnitControl(PU_SATURATION_CONTROL, Value);
                return;
            }

            break;

        case PU_SHARPNESS_CONTROL:
            if (Value >= uvcPuInfo.PU_SHARPNESS_MIN && Value <= uvcPuInfo.PU_SHARPNESS_MAX)
            {
                uvcInfo.CapFilter.Sharpness = Value;
                UVC_ProcessUnitControl(PU_SHARPNESS_CONTROL, Value);
                return;
            }

            break;

        case PU_GAMMA_CONTROL:
            if (Value >= uvcPuInfo.PU_GAMMA_MIN && Value <= uvcPuInfo.PU_GAMMA_MAX)
            {
                uvcInfo.CapFilter.Gamma = Value;
                UVC_ProcessUnitControl(PU_GAMMA_CONTROL, Value);
                return;
            }

            break;

        case PU_POWER_LINE_FREQUENCY_CONTROL:
            if (Value >= uvcPuInfo.PU_POWER_LINE_FREQUENCY_MIN && Value <= uvcPuInfo.PU_POWER_LINE_FREQUENCY_MAX)
            {
                uvcInfo.CapFilter.POWER_LINE_FREQUENCY = Value;
                UVC_ProcessUnitControl(PU_POWER_LINE_FREQUENCY_CONTROL, Value);
                return;
            }

            break;
    }

    uvcInfo.u8ErrCode = EC_Out_Of_Range;
}


void UVC_ActiveDMA(uint32_t u32Addr, uint32_t u32Len)
{
    /* Enable BUS interrupt */
    HSUSBD_ENABLE_BUS_INT(HSUSBD_BUSINTEN_DMADONEIEN_Msk | HSUSBD_BUSINTEN_SUSPENDIEN_Msk | HSUSBD_BUSINTEN_RSTIEN_Msk | HSUSBD_BUSINTEN_VBUSDETIEN_Msk);

    HSUSBD_SET_DMA_ADDR(u32Addr);
    HSUSBD_SET_DMA_LEN(u32Len);
    g_hsusbd_DmaDone = 0;
    HSUSBD_ENABLE_DMA();

    while (g_hsusbd_Configured)
    {
        if (g_hsusbd_DmaDone)
            break;

        if ((HSUSBD_IS_ATTACHED() == 0) || (gAppConnected == 0))
        {
            if (HSUSBD->DMACTL & 0x20)
            {
                HSUSBD_ResetDMA();
                HSUSBD->EP[EPA].EPRSPCTL |= HSUSBD_EPRSPCTL_FLUSH_Msk;
            }

            break;
        }
    }
}


