OpenNuvoton/M55M1BSP/SampleCode/MachineLearning/VisualWakeWords/Device/UVC/UVC.c
void UVC_IsoIn(uint32_t u32Addr, uint32_t u32Len)
{
    uint32_t u32Loop, toggle = 0;
    uint32_t i, header;
    uint8_t *ptr;

    if (uvcInfo.bChangeData == 1)
    {
        uvcInfo.bChangeData = 0;

        if (HSUSBD->DMACNT & 0x20)
        {
            HSUSBD_ResetDMA();
            uvcStatus.bReady = TRUE;
        }
    }

    /* iso in, dma read, epnum = 1 */
    HSUSBD_SET_DMA_READ(ISO_IN_EP_NUM);

    ptr = (uint8_t *)u32Addr;
    u32Loop = u32Len / USBD_MAX_DMA_LEN;

    for (i = 0; i < u32Loop; i++)
    {
        HSUSBD_ENABLE_EP_INT(EPA, HSUSBD_EPINTEN_TXPKIEN_Msk | HSUSBD_EPINTEN_SHORTTXIEN_Msk);
        g_hsusbd_ShortPacket = 0;
        /* Start of Transfer Payload Data */
        header = ((g_u8UVC_PD | (g_u8UVC_FID & 0x01)) << 8) | 0x02;

        while (1)
        {
            if (HSUSBD_GET_EP_INT_FLAG(EPA) & HSUSBD_EPINTSTS_BUFEMPTYIF_Msk)
            {
                HSUSBD->EP[EPA].EPDAT_BYTE = header & 0xff;
                HSUSBD->EP[EPA].EPDAT_BYTE = (header >> 8) & 0xff;

                if (toggle)
                {
                    HSUSBD->EP[EPA].EPDAT_BYTE = *ptr & 0xff;
                    HSUSBD->EP[EPA].EPDAT_BYTE = *(ptr + 1) & 0xff;

                    UVC_ActiveDMA((uint32_t)(ptr + 2), USBD_MAX_DMA_LEN - 2);
                }
                else
                {
                    UVC_ActiveDMA((uint32_t)ptr, USBD_MAX_DMA_LEN);
                }

                toggle ^= 1;
                ptr += USBD_MAX_DMA_LEN;
                break;
            }
        }
    }

    u32Loop = u32Len % USBD_MAX_DMA_LEN;

    if (u32Loop)
    {
        HSUSBD_ENABLE_EP_INT(EPA, HSUSBD_EPINTEN_TXPKIEN_Msk | HSUSBD_EPINTEN_SHORTTXIEN_Msk);
        g_hsusbd_ShortPacket = 1;
        header = ((g_u8UVC_PD | UVC_PH_EndOfFrame | (g_u8UVC_FID & 0x01)) << 8) | 0x02; //End Of Frame

        while (1)
        {
            if (HSUSBD_GET_EP_INT_FLAG(EPA) & HSUSBD_EPINTSTS_BUFEMPTYIF_Msk)
            {
                HSUSBD->EP[EPA].EPDAT_BYTE = header & 0xff;
                HSUSBD->EP[EPA].EPDAT_BYTE = (header >> 8) & 0xff;

                if (toggle)
                {
                    HSUSBD->EP[EPA].EPDAT_BYTE = *ptr & 0xff;
                    HSUSBD->EP[EPA].EPDAT_BYTE = *(ptr + 1) & 0xff;

                    UVC_ActiveDMA((uint32_t)(ptr + 2), u32Loop - 2);
                }
                else
                {
                    UVC_ActiveDMA((uint32_t)ptr, u32Loop);
                }

                g_u8UVC_FID++;
                break;
            }
        }
    }
}

int UVC_SendImage(uint32_t u32Addr, uint32_t u32transferSize, uint32_t bStillImage)
{
    if (u32transferSize != 0)
    {
        //printf("send: 0x%x, %d (%d)\n", u32Addr, u32transferSize, bStillImage);
        uvcStatus.bReady = 0;

        HSUSBD_ResetDMA();

        if (bStillImage)
        {
            g_u8UVC_PD = UVC_PH_Snapshot;       /* Payload Header for Snapshot */
            uvcStatus.StillImage = 0;
        }
        else
            g_u8UVC_PD = UVC_PH_Preview;        /* Payload Header for Preview */

        UVC_IsoIn(u32Addr, u32transferSize);

        return 1;
    }

    return 0;
}

bool UVC_IsConnect(void)
{
    if ((gAppConnected) && (HSUSBD_IS_ATTACHED()))
        return TRUE;

    return FALSE;
}

